package gachikoi

import "strings"

var translator = strings.NewReplacer(
	"ちこきゅちこきゅ〜", "ちこくちこく〜",
	"あちゃちかやみんにゃへのはっぴぃばえんたいんよ", "あたしからみんなゃへのハッピーバレンタインよ",
	"こえでにゃいの", "こえでないの",
	"ちかたにゃい…", "しかたない…",
	"ひちょはじゃぬぐわよ", "ひとはだぬぐわよ",

	"はっぴぃ", "ハッピー",
	"ばえんたいん", "バレンタイン",
	"あんちゃちゃち", "あんたたち",
	"どーが", "どうが",
	"ちこきゅするわ", "ちこくするわ",
	"ごめんにゃ", "ごめんね",
	"よにゃかにこーちんちゅるわね", "よなかにこーしんするわね",
	"いこにまっちぇゆのよ", "いいこにまってるのよ",

	"おひちゃち", "おひさし",
	"ちぇぶん", "セブン",
	"かわちぃちゅぎね", "かわいすぎね",
	"にゃんじゃか", "なんだか",
	"かえー", "カレー",
	"かやいらちい", "からいらしい",
	"かやちゃぎて", "からすぎて",
	"きょーにょ", "きょうの",
	"めいく", "メイク",
	"にちーく", "にチーク",
	"ふよー", "ふよう",

	"にゃんちょにゃんにゃんちょ", "なんとなんと",
	"はっじまゆお", "はっじまるよ",
	"あどべんちょ", "あどべんと",
	"ちゃんにぇう", "ちゃんねる",
	"あちゃちゃ", "あたし",
	"ちゃくらおんじょんちゅる", "ちゃくらおんぞんする",
	"こうちんなち", "こうしんなち",
	"ごめんにぇ", "ごめんね",

	"あちゃちのこちょ", "あたしのこと",
	"あんじぇん", "あんぜん",
	"おもっちぇた", "おもってた",
	"じゃんねんっっ", "ざんねんっ",
	"めいきゅ", "めいく",
	"がんばちゃた", "がんばっちゃった",
	"みなちゃい", "みなさい",
)

func Translate(input string) string {
	return translator.Replace(input)
}
